Tekla Open API Reference for Tekla Structures 2025
ComponentItem Class
 The ComponentItem class contains information about the components in the Tekla Structures catalog.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ComponentItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ComponentItem
<SerializableAttribute>
Public Class ComponentItem
The ComponentItem type exposes the following members.
Constructors
Name | Description
ComponentItem
 Creates a new component item instance.
Top
Properties
Name | Description
AttributeFileExtension
 Gets the attribute file extension of item from the component database.
Name
 The component item's internal name which is used by Tekla Structures in component identification.
Number
 The component item's internal number which is used by Tekla Structures in component identification.
Type
 The component item's type.
UIName
 The component item's name which is visible in the Tekla Structures user interface.
Top
Methods
Name | Description
Export
 Exports the custom component item in *.uel-format to the to given file name. If path is not given custom component is exported to model folder. If filename is empty custom component name is used as filename.
GetVersion
 Gets the version number of custom component item from the component database.
Select(String, Int32)
 Selects the component item from the component database. Uses the type if defined for selection
Select(String, Int32, ComponentItem.ComponentTypeEnum)
 Selects the component item from the component database.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace